**free
     // commented out
     // comment from tobi in inventory
      // comment from tobi in inventory
      dsply 'Tobi integrated in inventory';
      dsply 'Tobi integrated in inventory';

     *inlr = *on;