**free
dcl-s a  packed(2) Inz;
dcl-s b  packed(2) Inz;
dcl-s c  packed(2) Inz;

// tested
eval a = 1;
eval b = 2;
c = a + b;

dsply b;
// modified comment from TN5250
// added a new comment from FIx103
// added a new comment from FIx103
*inlr = *on;
