**free

dcl-s b  packed(2) Inz;
dcl-s c  packed(2) Inz;

// tested ravi
eval a = 1;
eval b = 2;
c = a + b;

// added a comment
dsply b;
*inlr = *on;

